/*
Задача 50. Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, и возвращает значение этого элемента или же указание, что такого элемента нет.
Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
17 -> такого числа в массиве нет
*/

//Методы
int InputNumber() //Ввод целого числа
{
    int number;
    bool flag;
    while (true)
    {
        flag = int.TryParse(Console.ReadLine()!, out number);
        if (flag)
        {
            break;
        }
        else
        {
            Console.WriteLine("Не верный ввод, введите целое число.");
            Console.Write("Введите число: ");
        }
    }
    return number;
}

//Основной код
int m = 4, n = 4;
int[,] array = new int[m, n];

for (int i = 0; i < m; i++)
{
    for (int j = 0; j < n; j++)
    {
        array[i, j] = new Random().Next(10);
        Console.Write($"{array[i, j]} ");
    }
    Console.WriteLine();
};

Console.WriteLine($"Введите позицию элемента");
int position = InputNumber();
if ((position / 10 > m) || (position % 10 > n)) Console.WriteLine("Такого числа в массиве нет.");
else Console.WriteLine($"На позиции {position} находится число: {array[position / 10 - 1, position % 10 - 1]} ");