/*
Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125
*/

int InputNumber() //Ввод целого положительного числа 
{
    int number;
    bool flag;
    while (true)
    {
        flag = int.TryParse(Console.ReadLine()!, out number);
        if (flag && number > 0)
        {
            break;
        }
        else
        {
            Console.WriteLine("Не верный ввод, введите целое положительное число.");
            Console.Write("Введите число: ");
        }
    }
    return number;
}

Console.WriteLine("Введите число N: ");
int numberN = InputNumber();

for (int i = 1; i < numberN + 1; i++)
{
    Console.Write($"{i * i * i} ");
}
