/*
Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12
*/

int InputNumber() //Ввод целого числа
{
    int _number;
    bool flag;
    while (true)
    {
        flag = int.TryParse(Console.ReadLine()!, out _number);
        if (flag)
        {
            break;
        }
        else
        {
            Console.WriteLine("Не верный ввод.");
            Console.Write("Введите число: ");
        }
    }
    return _number;
}

Console.WriteLine("Введите число: ");
int number = InputNumber();

int SumNums(int _number)
{
    int sumNums = 0;
    while (_number > 0)
    {
        sumNums += _number % 10;
        _number /= 10;
    }
    return sumNums;
}

int sumN = SumNums(number);
Console.WriteLine($"{sumN}");

